
public class Practice11 {

	public static void main(String[] args) {
		/*
		 * 성적관리에서 학생2명 데이타를 담을 변수선언 - 번호, 이름, 국어, 영어, 수학, 총점, 평균,
		 * 평점(A(90~100),B(80~89),C(70~79),D(60~69),F(0~59)), 석차
		 */
		int userNumber1, userNumber2;
		String name1, name2;
		int kor1, kor2;
		int eng1, eng2;
		int math1, math2;
		int tot1, tot2;
		double avg1, avg2;
		char grade1, grade2;

		/*
		 * 학생 2명의 기본데이터(번호, 이름, 국어, 영어, 수학) 입력
		 */

		userNumber1 = 1;
		name1 = "김경호";
		kor1 = 56;
		eng1 = 80;
		math1 = 98; 
				
	}


		/*
		 * 학생2명의 국어, 영어, 수학점수의 유효성체크 - 100점이 넘는 수나 음수가 입력되면 메세지를 출력하고 return(프로그램종료)한다.
		 */

		/*
		 * 학생 2명의 기본데이터(번호, 이름, 국어, 영어, 수학)를 이용해서 총점, 평균, 평점, 계산 후 대입 (석차는 0을 대입)
		 */

		/*
		 * - 출력포맷 - 평균은 소수점이하 첫째자리까지출력(반올림) - 석차는 구하지마세요 --------------학생
		 * 성적출력------------------- 학번 이름 국어 영어 수학 총점 평균 평점 석차
		 * ----------------------------------------------- 1 김경호 42 56 78 334 34.8 A 3 2
		 * 김경수 45 53 76 334 34.8 A 2 -----------------------------------------------
		 */

	
	
	
	
	
	
	
	/*---------------------------------------------------------------------------7/31(연습)
		/*
		 * 아래 정보를 담을 수 있는 변수 5개를 자바에서 알맞은 자료형을 사용하여 선언해 보세요.
		단, 변수 이름은 의미 있게 작성하세요.

		학생의 이름 (예: "김철수")

		학생의 나이 (예: 20세)

		학생의 키 (예: 174.5cm)

		학생이 재학 중인지 여부 (예: true 또는 false)

		학생의 학점 (예: 'A', 'B', 'C' 중 하나)
		 */
	
	
	

	
	
	
	
	}
	

